https://www.zhihu.com/question/20224354
https://autoitx.com/Doc/html/introduction.htm#:~:text=AutoIt%20v3%20%E6%98%AF%E7%94%A8%E4%BB%A5%E7%BC%96%E5%86%99%E5%B9%B6%E7%94%9F%E6%88%90%E5%85%B7%E6%9C%89%20BASIC,%E8%AF%AD%E8%A8%80%E9%A3%8E%E6%A0%BC%E7%9A%84%E8%84%9A%E6%9C%AC%E7%A8%8B%E5%BA%8F%E7%9A%84%E5%85%8D%E8%B4%B9%E8%BD%AF%E4%BB%B6%2C%E5%AE%83%E8%A2%AB%E8%AE%BE%E8%AE%A1%E7%94%A8%E6%9D%A5%E5%9C%A8Windows%20GUI%20%28%E7%94%A8%E6%88%B7%E7%95%8C%E9%9D%A2%29%E4%B8%AD%E8%BF%9B%E8%A1%8C%E8%87%AA%E5%8A%A8%E6%93%8D%E4%BD%9C.%E9%80%9A%E8%BF%87%E5%AE%83%E5%8F%AF%E4%BB%A5%E7%BB%84%E5%90%88%E4%BD%BF%E7%94%A8%E6%A8%A1%E6%8B%9F%E9%94%AE%E5%87%BB%2C%E9%BC%A0%E6%A0%87%E7%A7%BB%E5%8A%A8%E5%92%8C%E7%AA%97%E5%8F%A3%2F%E6%8E%A7%E4%BB%B6%E6%93%8D%E4%BD%9C%E7%AD%89%E6%9D%A5%E5%AE%9E%E7%8E%B0%E8%87%AA%E5%8A%A8%E5%8C%96%E4%BB%BB%E5%8A%A1%2C%E8%80%8C%E8%BF%99%E6%98%AF%E5%85%B6%E5%AE%83%E8%AF%AD%E8%A8%80%E6%89%80%E6%97%A0%E6%B3%95%E5%81%9A%E5%88%B0%E6%88%96%E5%B0%9A%E6%97%A0%E5%8F%AF%E9%9D%A0%E6%96%B9%E6%B3%95%E5%AE%9E%E7%8E%B0%E7%9A%84%20%28%E6%AF%94%E5%A6%82VBScript%E5%92%8CSendKeys%29.
有一个录制器 录制成autoit脚本
脚本精灵 有一个录制器 录制成对应的代码  可以从录制的代码学习  键盘鼠标操作的代码然后业务代码自己编写  提升编写效率
然后就要有一个好的ide  有智能提示  提升编写效率 然后就是 网上学习资料要多  解决问题的文章要多
调试要方便
AutoIt v3 是用以编写并生成具有 BASIC 语言风格的脚本程序的免费软件,它被设计用来在Windows GUI(用户界面)中进行自动操作.
通过它可以组合使用模拟键击,鼠标移动和窗口/控件操作等来实现自动化任务,
而这是其它语言所无法做到或尚无可靠方法实现的(比如VBScript和SendKeys). AutoIt 非常小巧,完全运行在所有windows操作系统上.并且不需要任何"运行库"
AutoIt 最初是为PC(个人电脑)的"批量处理"而设计,用于对数千台PC进行(同样的)配置.现在,autoit是一个支持复杂表达式,自定义函数,循环等的强大脚本软件. AutoIt 可以做的事:

简单易懂的类 BASIC 表达式
模拟键盘,鼠标动作事件
操作窗口与进程
直接与窗口的"标准控件"交互(设置/获取 文字,移动,关闭,等等)
脚本可以编译为标准可执行文件
创建用户图形界面接口(GUI)
COM支持
正则表达式
直接调用外部DLL 和 Windows API 函数
程序运行为功能(让程序运行于其它账户)
详细易懂的帮助文件于基于社区的支持论坛
完全兼容于 Windows 2000 / XP / 2003 / Vista / 2008 / 7
Unicode 与 64位 运算支持
高精度,易使用的数学运算
可以运行于 Windows Vista Account Control (UAC)
AutoIt 被设计得尽可能小,并且不用依赖外部DLL文件或添加注册表项目即可独立运行.也可以安全的成为服务运行.脚本可以使用Aut2Exe编译为可独立运行的文件

此外我们还设计了 AutoIt 的 ActiveX 和 DLL 版本 —— AutoItX.这是个组件化的语言(COM 同一 DLL 文件中的标准DLL函数).AutoItX 将使得您可以加入一些AutoIt 
独有的特性到您最常用的脚本语言或程序设计语言中去!

最重要的是,AutoIt 将继续是免费的
AutoIt 拥有类 BASIC 语言表达式.意味着使用过其它任意高级语言的作者都能简单的使用.即使是一个新手也能快速入门

尽管它的起点是一个简单的自动化工具,但是现在 AutoIt 现在拥有大量函数与新特性.能让您在使用它做到任何工作都是事半功倍.(它的自动化及自定义特性足以傲视群雄!)语言特性包括:

使用高级语言特性的函数,循环与表达式
令人惊讶的字符串操作 和 Perl 兼容正则表达式引擎(使用PCRE 函数库).
COM 支持
调用 Win32 与 第三方 DLL API
 

内置语法高亮的编辑器

AutoIt 包含了一个 自定义的小型版本的 SciTE 编辑器,它能使您编辑脚本更加方便.
用户可以参考 下载完整版本的 Autoit 专用 SciTe这个编辑器包含的附加工具让您编写脚本更加得心应手. 
(汉化版本中的编辑器来自SciTE官方,附加设置文件来源于autoit4scite.部分被加强修改)

 

独立小巧

AutoIt 是一个非常小并且独立的应用程序,完全不依赖像 .net 或者 vb 使用的厚重的运行库.所有您需要运行的脚本都能使用主程序执行(AutoIt3.exe), 
并且脚本可以使用脚本编译器Aut2Exe进行编码后内置于独立的可执行文件.

 

国际性 与 64-位 支持

AutoIt 是一个完全支持 Unicode 和 x64 构架的程序.它的重要性是不言而喻的. 
How many other free scripting languages can you say that about?(你敢说哪个其它的免费脚本软件已经实现?)

 

模拟键盘和鼠标

我们花了许多时间用在对键击和鼠标动作的模拟功能的优化上,使其在目前所有的操作系统上都可以做到尽可能的精确. 
所有模拟鼠标和键盘动作的程序在模拟动作的"速度"及其它功能上都是高度可定制的
窗口管理

您可以对窗口移动,隐藏,显示,修改大小,激活,关闭,等操作.对窗口本身的操作可以是关于标题,文本,大小,坐标,类,和内部 Win32 API 句柄.

 

控件

直接获取编辑框,复选框,列表框,选择框,按钮,状态栏上的信息,并且作用于这些控件而不必担心键击动作落空.甚至还可以作用于非活动窗口上的控件!

图形用户接口 (GUIs)
AutoIt v3 可以让您创建一些简单的 GUI-就像下方例子


